Tekla Open API Reference for Tekla Structures 2025
PluginBase.InputDefinition.GetInputType Method
 Returns the type of the input the current instance contains.
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public PluginBase.InputDefinition.InputTypeEnum GetInputType()
Public Function GetInputType As PluginBase.InputDefinition.InputTypeEnum
Return Value
Type: PluginBase.InputDefinition.InputTypeEnum
The type of the input.
See Also
Reference
PluginBase.InputDefinition Class
Tekla.Structures.Plugins Namespace